#Визначити, чи може слон перейти з першої клітини у другу за один хід
x1 = int(input('Введіть номер рядка першої клітинки:'))
y1 = int(input('Введіть номер стовпчика пешої клiтинки:'))
x2 = int(input('Введіть номер рядка  другої клітинки:'))
y2 = int(input('Введіть номер стовчика другої клітинки:'))
import math

if ((1<=y2<=8) and (1<=x1<=8) and (1<=x2<=8) and (1<=y1<=8)):#первірка введених чисе

    if(math.modf(x1 - y1) == math.modf(x2 - y2)):
        answer = 'YES'
    else:
        answer ='NO'
else:
    answer = 'NO'
print(answer)

