#Визначити, чи може тура перейти з першої клітини у другу за один хід.
x1 = int(input('Введіть номер стовпчика першої клітинки:'))
y1 = int(input('Введіть номер рядка пешої клiтинки:'))
x2 = int(input('Введіть номер стовпчика другої клітинки:'))
y2 = int(input('Введіть номер рядка другої клiтинки:'))
if ((1<= x1<= 8) and (1<=x2<=8) and (1<=y1<=8) and  (1<=y2<=8)):
    if (x1 == x2 and y1 != y2):
        ans = 'YES'
    elif(y1 == y2 and x1 != x2):
        ans = 'YES'
    else:
        ans = ('NO')
else:
    ans = ('Ви ввели не коректне число')
print(ans)



