#Визначити, чи може королева перейти з першої клітини у другу за один хід
x1 = int(input('Введіть номер рядка першої клітинки:'))
y1 = int(input('Введіть номер стовпчика пешої клiтинки:'))
x2 = int(input('Введіть номер рядка  другої клітинки:'))
y2 = int(input('Введіть номер стовчика другої клiтинки:'))
import math
if ((1<=y2<=8) and (1<=x1<=8) and (1<=x2<=8) and (1<=y1<=8)):
    if (x1 == x2 and y1 != y2):#умова, що визначає рух фігури по горизонталі
        answer = 'YES'
    elif(y1 == y2 and x1 != x2):#умова, що визначає рух фігури по веритикалі
        answer = 'YES'
    elif(math.modf(x1 - y1) == math.modf(x2 - y2)):# умова, що визначає рух фігури  по діагоналі
        answer = 'YES'
    else:
        answer = 'NO'
else:
    answer = 'NO'
print(answer)
