#Визначити, чи однакового клітинки  кольору
x1 = int(input('Введіть номер стовпчика першої клітинки:'))
y1 = int(input('Введіть номер рядка пешої клiтинки:'))
x2 = int(input('Введіть номер стовпчика другої клітинки:'))
y2 = int(input('Введіть номер рядка другої клiтинки:'))
if ( 1<=x1<=8 and 1<=x2<=8 and 1<=y1<=8 and 1<=y2<=8):
    if ((x1==x2) or (y1==y2)):
        answer = "Це одна клітинка"
    else:
        if ((x1+y1)%2 == 0 and (x2+y2)%2 == 0):
            answer = 'YES'
        elif((x1+y1)%2 == 0 and (x2+y2)%2 == 0):
            answer = 'YES'
        else:
            answer ='NO'
else:
    answer = 'Ви ввели некоректне число'
print(answer)

