print("\n Умова: Нехай число N - кількість хвилин, відрахованих після півночі. "
          "\n Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?"
          "\n Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). "
          "\n Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим."
          "\n Вхідні дані: 1 ціле число, що вводить користувач."
          "\n Вихідні дані: вивести два числа. Перше - години, друге - хвилини.\n")
time = int(input(" Kilkyst hvylyn typu int: "))
time = int(time % 1440)
if time % 60 < 10:
    print(" "+str(time // 60) + ":0" + str(time % 60))
else:
    print(" "+str(time // 60) + ":" + str(time % 60))
input()
