"""
N кеглів виставили в один ряд, занумерованих їх зліва направо числами від 1 до N. Потім з цього ряду кинули K куль, при цьому i-й куля збив всі кеглі з номерами від li до ri включно. Визначте, які кеглі залишилися стояти на місці.

Програма отримує на вхід кількість кеглів N і кількість кидків K. Далі йде K пар чисел li, ri, при цьому 1≤ li≤ ri≤ N.

Програма повинна вивести послідовність з N символів, де j-й символ є "I", якщо j-я кегля залишилася стояти, або ".", Якщо j-я кегля була збита.
""" 
kegli = int(input("Введіть кількість кеглів "))
broski = int(input("Введіть кількість кидків "))
nn = []
for i in range(0,kegli):
    nn.append("|")
for i in range(0 ,broski):
    li = int(input("Введіть менший номер "))
    ri = int(input("Введіть більший номер "))
    for i in range(li-1 , ri):
        nn[i] = "."
ans = ""
for i in nn:
    ans += i
print(ans) 
