"""
Петя перейшов в іншу школу. На уроці фізкультури йому знадобилося визначити своє місце в строю. Допоможіть йому це зробити.Програма отримує на вхід незростаючу послідовність натуральних чисел, що означають зріст кожної людини в строю. Після цього вводиться число X - зріст Петі. Усі числа у вхідних даних натуральні і не перевищують 200. Виведіть номер, під яким Петя повинен стати до строю. Якщо в строю є люди з однаковим зростом, таким же, як у Петі, то він повинен встати після них.
"""
poslid = input("Введіть послідовність чисел")
value = int(input("Введіть число зросту"))
poslid = poslid.split(" ")
poslid = [int(i) for i in poslid]
i= 0
while poslid[i]<=value:
    i += 1
print("Позиція в масиві %d ,позиція в людській черзі %d" % (i , i+1))
